frontend/models/Order/Orderinfo.php

	 public function OrderList($id)
	{
		 return $this->find()
				->select(["zss_order_info.menu_id","zss_order_info.menu_num","zss_order_info.menu_price","zss_order_info.created_at","zss_menu.menu_name","zss_menu.menu_code"])
				->leftJoin("zss_menu","zss_menu.menu_id = zss_order_info.menu_id")
				->where(["order_id"=>$id])
				->asArray()
				->all();
---
SELECT `zss_order_info`.`menu_id`, `zss_order_info`.`menu_num`, `zss_order_info`.`menu_price`, `zss_order_info`.`created_at`, `zss_menu`.`menu_name`, `zss_menu`.`menu_code` FROM `zss_order_info` LEFT JOIN `zss_menu` ON zss_menu.menu_id = zss_order_info.menu_id WHERE `order_id`='128'