frontend/models/Order/Order.php

SELECT `zss_order`.`order_id`, `type_name`, `order_payment`, `zss_shop`.`shop_name`, `order_sn`, `zss_order`.`created_at`, `zss_order`.`meal_number`, `zss_order`.`seat_number`, `order_status`, `zss_order`.`share_wallet`, `delivery_type`, `order_success`, `confirm_time`, `zss_order_admin`.`order_id` AS `deli` FROM `zss_order` LEFT JOIN `zss_user` ON zss_order.user_id = zss_user.user_id LEFT JOIN `zss_type` ON zss_order.delivery_type = zss_type.type_id LEFT JOIN `zss_shop` ON zss_shop.shop_id = zss_order.shop_id LEFT JOIN `zss_order_admin` ON zss_order_admin.order_id = zss_order.order_id WHERE `zss_user`.`user_id`=83 ORDER BY `zss_order`.`order_id` DESC
SELECT `zss_shop`.`shop_name` FROM `zss_order` LEFT JOIN `zss_user` ON zss_order.user_id = zss_user.user_id LEFT JOIN `zss_type` ON zss_order.delivery_type = zss_type.type_id LEFT JOIN `zss_shop` ON zss_shop.shop_id = zss_order.shop_id WHERE `delivery_type`='1' ORDER BY `order_id` DESC
SELECT `is_make` FROM `zss_order_info` WHERE `order_id`='128'
---
	 public function userOrder($where)
	 {
		 //获取订单列表
		 $list = $this->find()
				->select(["zss_order.order_id","type_name","order_payment","zss_shop.shop_name","order_sn","zss_order.created_at","zss_order.meal_number","zss_order.seat_number","order_status","zss_order.share_wallet","delivery_type","order_success","confirm_time","zss_order_admin.order_id as deli"])
				->leftJoin("zss_user","zss_order.user_id = zss_user.user_id")
				->leftJoin("zss_type","zss_order.delivery_type = zss_type.type_id")
				->leftJoin("zss_shop","zss_shop.shop_id = zss_order.shop_id")
				->leftJoin("zss_order_admin","zss_order_admin.order_id = zss_order.order_id")
				->orderBy(['zss_order.order_id'=>SORT_DESC])
				->where($where)
				->asArray()
				->all();
		 //获取订单的make
		 foreach($list as $key=>$val)
		 {
			 $list[$key]['make'] = $rows = (new \yii\db\Query())->select(['is_make'])->from('zss_order_info')->where(['order_id'=>$val['order_id']])->all();

SELECT `shop_name`, `lunchbox`, `zss_order`.`order_id`, `order_sn`, `zss_order`.`seat_number`, `zss_order`.`meal_number`, `site_name` AS `user_name`, `order_payment`, `order_total`, `pay_type`, `pay_status`, `wallet`, `sub`, `msg`, `coupon`, `delivery_type`, `order_freight`, `site_phone` AS `user_phone`, `site_detail` AS `order_address`, `zss_order`.`created_at`, `payonoff`, `pay_at`, `confirm_time`, `order_success` FROM `zss_order` LEFT JOIN `zss_site` ON zss_order.order_address = zss_site.site_id LEFT JOIN `zss_type` ON zss_order.delivery_type = zss_type.type_id LEFT JOIN `zss_shop` ON zss_order.shop_id = zss_shop.shop_id WHERE `zss_order`.`order_id`='46'
---
	 public function OrderList($id)
	{
		 return $list = $this->find()
				->select(["shop_name","lunchbox","zss_order.order_id","order_sn","zss_order.seat_number","zss_order.meal_number","site_name as user_name","order_payment","order_total","pay_type","pay_status","wallet","sub","msg","coupon","delivery_type","order_freight","site_phone as user_phone","site_detail as order_address","zss_order.created_at","payonoff","pay_at","confirm_time","order_success"])
				->leftJoin("zss_site","zss_order.order_address = zss_site.site_id")
				->leftJoin("zss_type","zss_order.delivery_type = zss_type.type_id")
				->leftJoin("zss_shop","zss_order.shop_id = zss_shop.shop_id")
				->where(["zss_order.order_id"=>$id])
				->asArray()
				->one();

SELECT `username`, `phone`, `add_time` FROM `zss_order` LEFT JOIN `zss_order_admin` ON zss_order_admin.order_id = zss_order.order_id LEFT JOIN `zss_admin` ON zss_admin.id = zss_order_admin.admin_id WHERE `zss_order`.`order_id`='46'
SELECT `username`, `phone`, `add_time` FROM `zss_order` LEFT JOIN `zss_order_admin` ON zss_order_admin.order_id = zss_order.order_id LEFT JOIN `zss_admin` ON zss_admin.id = zss_order_admin.admin_id WHERE `zss_order`.`order_id`='128'
---
	function distribution($order_id)
	{
		return $this->find()
				->select(['username',"phone","add_time"])
				->leftJoin("zss_order_admin","zss_order_admin.order_id = zss_order.order_id")
				->leftJoin("zss_admin","zss_admin.id = zss_order_admin.admin_id")
				->where(["zss_order.order_id"=>$order_id])
				->asArray()
				->one();
		/*
		$result = (new \yii\db\Query())
				->select("distribution_id,add_time")
				->from('zss_order_distribution')
				->where(['order_id' => $order_id])
				->one();