frontend/models/Carousel.php

SELECT `carousel_wx` FROM `zss_carousel` INNER JOIN `zss_group` on `zss_carousel`.`group_id` = `zss_group`.`group_id` WHERE zss_group.group_show = 1 && group_show = 1 ORDER BY `zss_carousel`.`updated_at` LIMIT 3
---
    public function GetNewCarousel(){
        return $this->find()
        ->select(['carousel_wx'])
        ->innerJoin("`zss_group` on `zss_carousel`.`group_id` = `zss_group`.`group_id`")
        ->orderBy('zss_carousel.updated_at')
        ->where("zss_group.group_show = 1 && group_show = 1")
        ->asArray()
        ->limit(3)
        ->all();