frontend/models/Shop.php

    public function AllShop(){
        return $this->find()->select(['shop_id','shop_x','shop_y'])->asArray()->all();
---
SELECT `shop_id`, `shop_x`, `shop_y` FROM `zss_shop`