frontend/models/ShopMenu.php

SELECT `zss_menu`.`menu_id`, `menu_name`, `menu_price`, `image_wx`, `menu_introduce`, `zss_menu`.`series_id` FROM `zss_shop_menu` INNER JOIN `zss_menu` on `zss_shop_menu`.`menu_id` = `zss_menu`.`menu_id` INNER JOIN `zss_image` on `zss_menu`.`menu_id` = `zss_image`.`model_id` INNER JOIN `zss_series` on `zss_menu`.`series_id` = `zss_series`.`series_id` WHERE zss_series.series_status = 1
---
    public function GetShopMenu($shop_id){
        $shop_data = $this->find()
            ->select(['zss_menu.menu_id','menu_name','menu_stock','menu_price','image_wx','menu_introduce','img1','img2'])
            ->innerJoin("`zss_menu` on `zss_shop_menu`.`menu_id` = `zss_menu`.`menu_id`")
            ->innerJoin("`zss_image` on `zss_menu`.`menu_id` = `zss_image`.`model_id`")
            ->innerJoin("`zss_series` on `zss_menu`.`series_id` = `zss_series`.`series_id`")
            ->where("shop_id = $shop_id && `zss_shop_menu`.`is_show` = 1")
            ->asArray()->all();